[{"title": "Junior Python Developer", "company": "Patterned Learning AI", "level": "Entry level", "location": "San Francisco, CA", "employment_type": "Full-time", "description": "REMOTE (US/Canada Residing people only, with work permit)Patterned Learning – Junior Python Developer , FULL-TIME, Salary $100K - $130K a year.About us: The Future of AI is Patterned, a stealth-mode technology startup."}, {"title": "Python Developer - Remote", "company": "Enexus Global Inc.", "level": "Entry level", "location": "Jersey City, NJ", "employment_type": "Full-time", "description": "Role :- Python Full Stack developer / Software developer Location :- RemoteContract Type :- Full Time onlyJob Specification and Skills:-At least 2-3 years working with PythonAbility to follow through with assigned projects independentlyProven experience in engineering and software architecture designBachelor's degree in Computer Science along with equivalent experience5+ years of experience with full stack programming with emphasis in:2+ years of Python ProgrammingUI/UX development in JavaScript/HTML ecosystemsProven experience in engineering and software architecture designExpert in JavaScript frameworks like Vue."}, {"title": "Python Developer (Entry Level )", "company": "Patterned Learning AI", "level": "Entry level", "location": "San Francisco, CA", "employment_type": "Full-time", "description": "REMOTE (US/Canada Residing people only, with work permit)Patterned Learning – Python Developer (Entry Level ) , FULL-TIME, Salary $100K - $130K a year.About us: The Future of AI is Patterned, a stealth-mode technology startup."}, {"title": "Python Developer", "company": "TekVivid, Inc", "level": "Entry level", "location": "Jersey City, NJ", "employment_type": "Contract", "description": "FOR W2 CONTRACT Position: Python Developers  Location: Jersey, City, NJ for hiring event– Hybrid (3 days in office, 2 days at home. Can sit in Jersey City NJ (1st preferred), Charlotte, NC(2nd preferred) or NYC, NY (3rd option based off office space) Duration: 12+ Month Contract on w2 Work Authorization US,GC, TN, H4, OPT (must provide card expiration needs to be after 4/24/2024)   Interview Mode: Show up for hiring event, meet teams interested, receive offer before leaving (event is from 9:30-1:30pm so everyone gets a chance – it's possible to receive offer in first 30 minutes and then you can go home – manager's decide when you're interviewed."}, {"title": "Python Engineer", "company": "Improvado", "level": "Entry level", "location": "Austin, TX", "employment_type": "Full-time", "description": "About ImprovadoWe are a Series A startup with $30 million just raised in investments. We are rapidly scaling and doubling revenue growth every year."}, {"title": "Python Developer", "company": "EMERGICON", "level": "Mid-Senior level", "location": "Terrell, TX", "employment_type": "Full-time", "description": "We are looking for a Python Developer with strong Python experience to join our Engineering team. The Python Developer is responsible for maintaining and improving existing Python scripts and packages, as well as designing and building new ones."}, {"title": "Junior Data Scientist, L'Oreal Research & Innovation", "company": "L'Oréal", "level": "Not Applicable", "location": "Clark, NJ", "employment_type": "Full-time", "description": "Job Title Sr Analyst I – Junior Data ScientistDivision:  Research & InnovationLocation:  Clark, NJReports To: VP, NA Digital Transformation ITWho We AreFor more than a century, L’Oréal has devoted its energy, innovation, and scientific excellence solely to one business: Beauty. Our goal is to offer each and every person around the world the best of beauty in terms of quality, efficacy, safety, sincerity and responsibility to satisfy all beauty needs and desires in their infinite diversity."}, {"title": "Python Developer", "company": "Donato Technologies, Inc.", "level": "Mid-Senior level", "location": "Houston, TX", "employment_type": "Full-time", "description": "Title: Python DeveloperClient: JPMCLocation: Houston, TXJob DescriptionExperience 10 Years (minimum)AWS experience is must.knowledgeable with center Python web frameworks, Object social mappers."}, {"title": "Python Developer (FASTAPI)-US", "company": "Zortech Solutions", "level": "Mid-Senior level", "location": "Jersey City, NJ", "employment_type": "Contract", "description": "Role: Python Developer (FASTAPI)Location: Remote (preferably NJ)Duration: 6+ MonthsJob DescriptionMUST have skills - Python, FASTAPIMUST have experience A total of 5+ years of experience (including 3+ years in Python, FASTAPI)3+ years of hands-on programming with Python + experience working on FASTAPI web framework for developing API's.Should have experience in gathering and addressing technical requirements."}, {"title": "Python Development-US", "company": "Zortech Solutions", "level": "Mid-Senior level", "location": "Austin, TX", "employment_type": "Contract", "description": "Role: Python DevelopmentLocation: Austin TX/RemoteDuration: 6+ MonthsJob Description12+ years of experience in python development10+ years of experience in UNIT test10+ years of experience in Python FLASK development8+ years of experience in building API/microservices development6+ years of experience in GitHubHands on experiences in AWS lambda, CloudFront, S3 & EKSHands on experience in DockerNice to have Octopus & TeamCity experience                        ."}, {"title": "Python Software Engineer", "company": "Pulivarthi Group (PG)", "level": "Entry level", "location": "Boston, MA", "employment_type": "Contract", "description": "Follow us on Linkedin: https://www.linkedin."}, {"title": "Remote Python Developer", "company": "The Computer Merchant, LTD (TCM)", "level": "Entry level", "location": "Jacksonville, FL", "employment_type": "Contract", "description": "Job DescriptionJOB TITLE: Python Developer JOB LOCATION: Remote WAGE RANGE*: 58 - 64.00/ hour Must be US Citizen or Green Card holder JOB NUMBER: 23-00890Job SummaryResponsible for development, programming, coding of Information Technology solutions using Python to enable Customer Experience applications."}, {"title": "Python Developer", "company": "Diverse Lynx", "level": "Entry level", "location": "Mountain View, CA", "employment_type": "Full-time", "description": "Job DescriptionRole: Python Developer Location: Mountain View, CA (Onsite from day one)Job DescriptionPython Coding ExperienceAutomation ExperienceAndroid ExperienceSelenium/ any other automation tool experienceDebugging Experience                        ."}, {"title": "Python Developer", "company": "Improvado", "level": "Entry level", "location": "Austin, TX", "employment_type": "Full-time", "description": "About ImprovadoWe are a Series A startup with $30 million just raised in investments. We are rapidly scaling and doubling revenue growth every year."}, {"title": "Python API Developer", "company": "Veridic Solutions", "level": "Entry level", "location": "Santa Clara, CA", "employment_type": "Full-time", "description": "Role:- Python API DeveloperLocation:- San Jose, CAMust Have8+ Yrs ExpAPIPython Development 8 Years                              ."}, {"title": "Python Developer I", "company": "Sonic Healthcare USA", "level": "Entry level", "location": "Austin, TX", "employment_type": "Full-time", "description": "Position SummaryJob Functions, Duties, Responsibilities and Position Qualifications:The ideal candidate for a Python Developer I is a seasoned professional with at least 2 years of experience in Python development. They have a strong understanding of the Python language and its frameworks, as well as experience in building and maintaining large-scale applications."}, {"title": "Python Fullstack Developer", "company": "IT Minds LLC", "level": "Entry level", "location": "United States", "employment_type": "Full-time", "description": "Job title : Python Fullstack DeveloperJob location : Remote6+ Months Contract Job DescriptionMust have strong Python and AWS experienceExperience coding in Python, and Django, Experience with front-end UI technology such as Angular, VUE REST, XML, SQL, JDBC, JSF, Web services, JUnit JIRA, Service Now Bamboo, Eclipse / IntelliJ, Jenkins, Go-CD Git / Stash PostgreSQL/MySQL DB. Experience with container-based development and management (Docker, Kubernetes) Experience with logging and monitoring platforms (DataDog, SumoLogic, Splunk, SignalFx) Cloud technologies / AWS (Kinesis, S3, RDS, SNS, Aurora, Lambda, CloudWatch, CloudTrail, IAM) Strong troubleshooting and debugging skills."}, {"title": "Senior Python Developer - REMOTE", "company": "HappyFunCorp", "level": "Mid-Senior level", "location": "Austin, TX", "employment_type": "Full-time", "description": "This position is 100% remote*; The hourly rate is $60-80/hr on a 1099. For over ten years, HappyFunCorp has been helping businesses develop great products and deliver technical solutions with a blend of strong engineering skills, human-focused design, and culture that makes working with us enjoyable."}, {"title": "Python Developer", "company": "Patterned Learning AI", "level": "Entry level", "location": "San Francisco, CA", "employment_type": "Full-time", "description": "REMOTE (US/Canada Residing people only, with work permit)Patterned Learning – Python Developer , FULL-TIME, Salary $170K - $200K a year.About us: The Future of AI is Patterned, a stealth-mode technology startup."}, {"title": "Python Developer", "company": "TekVivid, Inc", "level": "Entry level", "location": "Charlotte, NC", "employment_type": "Contract", "description": "W2 CONTRACT Python Developers Location: in Jersey City, NJ or Charlotte, NC, New York, NY (Need to prepared to work hybrid model from day 1) Duration: 18 months Work Authorization: USC or Green Card, H4 EAD, OPT  Interview Mode 2 WebEx interviews with team and then decision (Gliders are required)     Responsibilities:   Design and build horizontally scalable components within the major platform that the team is developing  Review and provide code feedback in terms of best practices with keen eye towards performance and stability optimizations  Become subject matter expert on code deployed on our platform and mentor other developers  Write reusable and extendable code and become a key contributor of the core platform  Consistently work to make our software simpler  Challenge yourself and your peers to always improve  Requirements:   Expertise in functional and object-oriented programming, specifically in Python  Experience in databases (relational/document/etc.) including NoSQL databases  Strong in algorithms and data structures  Experience building distributed and scalable complex services as well as robust micro services  Experience writing unit tests in Pytest or Unittest  Working knowledge of CI/CD pipelines and automation  Strong sense of ownership, urgency, and drive  Self-motivated with a strong work ethic and a passion for learning and problem solving  Strong experience developing user-friendly applications with JavaScript/Angular, Java, Spring Boot (with an emphasis on the front-end components in JavaScript/Angular)  Ability to provide technical guidance to peer team members  Experience writing tests (unit, integration, etc."}, {"title": "Python Developer", "company": "Diverse Lynx", "level": "Entry level", "location": "Charlotte, NC", "employment_type": "Full-time", "description": "Job Description Diverse Lynx LLC is an Equal Employment Opportunity employer. All qualified applicants will receive due consideration for employment without any discrimination."}, {"title": "Python Developer", "company": "Purple Drive Technologies", "level": "Entry level", "location": "Austin, TX", "employment_type": "Contract", "description": "Python role requirements - Development capability – Python backend API/Service to read the data from either from file or database as the source, then do ETL Independent, who can coordinate with business understand the requirements, do extraction, translation/transform and load to the target                          ."}, {"title": "Entry Level Data Scientist", "company": "Intuitive Research and Technology Corporation", "level": "Entry level", "location": "Huntsville, AL", "employment_type": "Full-time", "description": "INTUITIVE® is a nationally recognized Best Place to Work that provides solutions from design through production to sustainment by delivering targeted results. Our approach couples the latest technology with engineering expertise and analytical proficiency while remaining true to genuine customer relationships and a culture that fosters growth and opportunity."}, {"title": "Full stack Python Developer", "company": "Natsoft", "level": "Mid-Senior level", "location": "Pleasanton, CA", "employment_type": "Contract", "description": "Job Position:Python Fullstack DeveloperLocation:Pleasanton, CA(Onsite)Duration:12+MonthsRequired SkillsPython, MongoDB, SQL, Node.js, Angular 7+, restful APIs, SQL, Apache Cassandra, mostly backend -Some frontend experience, angular, javascript, java, python etc -Flask, Docker, Kubernetes, microservice architecture -Good communicationDescriptionJob Description:Looking for someone that has the willingness to take risks to develop technologies in uncharted waters, ambition to set a new technical standard."}, {"title": "Computer Science", "company": "Huntsville City Schools", "level": "Entry level", "location": "Huntsville, AL", "employment_type": "Full-time", "description": "Duty Days 187Salary Range: From/To Teacher Salary ScheduleEndorsementsGeneral ScienceOther, please specifyAdditional Job InformationThis position is for the 23/24 school year.Job Attachment View AttachmentThis position is for the 23/24 school year."}]